# Файл для функция с локациями.


def home_location():
    # Локация - Дом.
    print('\n--- 🏠 Home Location ---')
    print('В данный момент вы находитесь Дома.')
    print('Содержимое локации находится в разработке.')


def gym_location():
    # Локация - Спортзал.
    # На тренировку тратяться шаги + энергия + $.
    print('\n--- 🏋️ Gym Location ---')
    print('В данный момент вы находитесь в Спортзале.')
    print('Содержимое локации находится в разработке.')


def shop_location():
    # Локация - Магазин.
    print('\n--- 🛒 Shop Location ---')
    print('В данный момент вы находитесь в Магазине.')
    print('Содержимое локации находится в разработке.')


def work_location():
    # Локация - Работа.
    # За работу предусмотрена почасовая оплата сессиями по 30 минут.
    # На работу тратится время (1 час) + шаги (1000) + энергия (10 ед).
    # Вакансии: Завод - 4$
    print('\n--- 🏭 Work Location ---')
    print('В данный момент вы находитесь на Работе.')
    print('Содержимое локации находится в разработке.')


def adventure_location():
    # Локация - Приключения.
    print('\n--- 🗺️ Adventure Location ---')
    print('В данный момент вы находитесь в Приключениях.')
    print('Содержимое локации находится в разработке.')


def garage_location():
    # Локация - Гараж.
    print('\n--- 🚗 Garage Location ---')
    print('В данный момент вы находитесь в Гараже.')
    print('Содержимое локации находится в разработке.')


def auto_dialer_location():
    # Локация - Авто-дилер.
    print('\n--- Auto Dialer Location ---')
    print('В данный момент вы находитесь у Авто-Дилера.')
    print('Содержимое локации находится в разработке.')


def bank_location():
    # Локация - Банк.
    print('\n--- Bank Location ---')
    print('В данный момент вы находитесь в Банке.')
    print('Содержимое локации находится в разработке.')
